{
    "<BOS>": 0,
    "<SEP>": 1,
    "<EOS>": 2,
    "<UNK>": 3,
    "<PAD>": 4,
    "N20": 5,
    "N19": 6,
    "N18": 7,
    "N17": 8,
    "N16": 9,
    "N15": 10,
    "N14": 11,
    "N13": 12,
    "N12": 13,
    "N11": 14,
    "N10": 15,
    "N9": 16,
    "N8": 17,
    "N7": 18,
    "N6": 19,
    "N5": 20,
    "N4": 21,
    "N3": 22,
    "N2": 23,
    "N1": 24,
    "L20": 25,
    "L19": 26,
    "L18": 27,
    "L17": 28,
    "L16": 29,
    "L15": 30,
    "L14": 31,
    "L13": 32,
    "L12": 33,
    "L11": 34,
    "L10": 35,
    "L9": 36,
    "L8": 37,
    "L7": 38,
    "L6": 39,
    "L5": 40,
    "L4": 41,
    "L3": 42,
    "L2": 43,
    "L1": 44,
    "S20": 45,
    "S19": 46,
    "S18": 47,
    "S17": 48,
    "S16": 49,
    "S15": 50,
    "S14": 51,
    "S13": 52,
    "S12": 53,
    "S11": 54,
    "S10": 55,
    "S9": 56,
    "S8": 57,
    "S7": 58,
    "S6": 59,
    "S5": 60,
    "S4": 61,
    "S3": 62,
    "S2": 63,
    "S1": 64,
    "0": 65,
    "1": 66,
    "2": 67,
    "3": 68,
    "4": 69,
    "5": 70,
    "6": 71,
    "7": 72,
    "8": 73,
    "9": 74,
    "A": 75,
    "B": 76,
    "C": 77,
    "D": 78,
    "E": 79,
    "F": 80,
    "G": 81,
    "H": 82,
    "I": 83,
    "J": 84,
    "K": 85,
    "L": 86,
    "M": 87,
    "N": 88,
    "O": 89,
    "P": 90,
    "Q": 91,
    "R": 92,
    "S": 93,
    "T": 94,
    "U": 95,
    "V": 96,
    "W": 97,
    "X": 98,
    "Y": 99,
    "Z": 100,
    "a": 101,
    "b": 102,
    "c": 103,
    "d": 104,
    "e": 105,
    "f": 106,
    "g": 107,
    "h": 108,
    "i": 109,
    "j": 110,
    "k": 111,
    "l": 112,
    "m": 113,
    "n": 114,
    "o": 115,
    "p": 116,
    "q": 117,
    "r": 118,
    "s": 119,
    "t": 120,
    "u": 121,
    "v": 122,
    "w": 123,
    "x": 124,
    "y": 125,
    "z": 126,
    "!": 127,
    "\"": 128,
    "#": 129,
    "$": 130,
    "%": 131,
    "&": 132,
    "'": 133,
    "(": 134,
    ")": 135,
    "*": 136,
    "+": 137,
    ",": 138,
    "-": 139,
    ".": 140,
    "/": 141,
    ":": 142,
    ";": 143,
    "<": 144,
    "=": 145,
    ">": 146,
    "?": 147,
    "@": 148,
    "[": 149,
    "\\": 150,
    "]": 151,
    "^": 152,
    "_": 153,
    "`": 154,
    "{": 155,
    "|": 156,
    "}": 157,
    "~": 158
}